List<String> examQuestions = [
  "هل يقرأ بصوت مرتفع وحاد ويضغط على مخارج الحروف؟",
  "هل يقاوم القراءة، ويكسر الحروف والمقاطع والكلمات؟",
  "هل يفقد مكان القراءة، ويعيد ما يقرأ دون الربط بين المعاني؟",
  "هل يبدو قلقًا مرتبكًا، مجهدًا وعصبيًا عند القراءة؟",
  "هل يحذف بعض الكلمات أو يقفز من موقع إلى آخر أثناء القراءة؟",
  "هل يستبدل بعض الكلمات بكلمات أخرى غير موجودة في النص؟",
  "هل يقرأ مسترسلاً دون توقف عند المعاني أو الأفكار؟",
  "هل يخطئ في نطق الحروف والمقاطع والكلمات؟",
  "هل يقرأ بلا وعي أو فهم أو استساغة لما يقرأ؟",
  "هل يبدي ترددًا عند الكلمات التي لا يستطيع نطقها؟",
  "هل يجد صعوبة في التعرف على الحروف والمقاطع والكلمات؟",
  "هل يجد صعوبة في إعادة مضمون قصة قصيرة بعد قراءتها؟",
  "هل يصعب عليه استنتاج الأفكار الفرعية والفكرة الرئيسة لما يقرأ؟",
  "هل يقرأ بطريقة متقطعة: حرف حرف، مقطع مقطع، كلمة كلمة؟",
  "هل يجد صعوبة في استخدام النقط والفواصل والوقف عند القراءة؟"
];
